{
  "sample_size": 128,
  "patch_size": 2,
  "in_channels": 16,
  "num_layers": 24,
  "attention_head_dim": 64,
  "num_attention_heads": 24,
  "joint_attention_dim": 4096,
  "caption_projection_dim": 1536,
  "pooled_projection_dim": 2048,
  "out_channels": 16,
  "pos_embed_max_size": 384,
  "dual_attention_layers": [
    0,
    1,
    2,
    3,
    4,
    5,
    6,
    7,
    8,
    9,
    10,
    11,
    12
  ],
  "qk_norm": "rms_norm",
  "_class_name": "SD3Transformer2DModel",
  "_diffusers_version": "0.31.0.dev0",
  "_name_or_path": "C:\\Users\\Fatim_Sproj\\.cache\\huggingface\\hub\\models--stabilityai--stable-diffusion-3.5-medium\\snapshots\\b940f670f0eda2d07fbb75229e779da1ad11eb80\\transformer"
}